cf/BusinessProcesses/СборкаЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>СборкаЗаказа</Name>
			<BasedOn>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчеистаяСборка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжатьСобирать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/InformationRegisters/ОчередьСборкиПриПередачеЛогисту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСборкиПриПередачеЛогисту</Name>
			<Comment>Скоклько прошло с момента отправления заказа в очередь менеджером логисту</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтсчета</Name>
					<Comment>От нее считаем скоко секундоф прошло</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозвратуМенеджеру</Name>
					<Comment>Когда заказ со сборки был возвращаен менеджеру для корректировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСборки</Name>
					<Comment>используем текущую дату при вычислении если эта не заполнена</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентРучнойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Акция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ИнтернетЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ИнтернетЗаказПокупателя</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтернетЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентРучнойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Акция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ВнутренниеЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ВнутренниеЗаказы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/СостоянияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСкладПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобранЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьГарантию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвестиДефектовку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаСкладВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредупредитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПоТехническимПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Когда товар отправлен в доставку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
					<Comment>Когда товар принял получатель или транспортная компания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/СостояниеСборкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостояниеСборкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Возвращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСобрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобираетсяИзЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/BusinessProcesses/СборкаЗаказа/Ext/ObjectModule.bsl
Функция ПолучитьЗаказ(Задача)
	
	Заказ = Задача.БизнесПроцесс.Заказ;
	
	Если Заказ = Неопределено Тогда
		Заказ = Задача.БизнесПроцесс.ВедущаяЗадача.Заказ;
	КонецЕсли;
	
	Возврат Заказ;
	
КонецФункции

Процедура УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Наименование = ПредставлениеЗадачи(Задача);
		Задача.Склад 		= Ссылка.Склад;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанных = Тип("Структура") Тогда
		
		КонвертацияТипов.ЗаполнитьОбъектПоСтруктуреОснованию(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ТипДанных = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Заказ 	= ДанныеЗаполнения;
		Склад 	= ДанныеЗаполнения.Склад;
		
	ИначеЕсли ТипДанных = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		
		Заказ = ДанныеЗаполнения;
		Склад = ДанныеЗаполнения.Склад;
		
	КонецЕсли; 
	
КонецПроцедуры

 
// СТАНДАРТНЫЙ ИНТЕРФЕЙС

Процедура ЗавершениеПриЗавершенииПлохо(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.ВРаботе) Тогда Отказ = Истина КонецЕсли;
	
	// Установим время передачи заказа менеджеру для корректировки
	
	Запись = РегистрыСведений.ОчередьСборкиПриПередачеЛогисту.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	
	Запись.Заказ 					= Заказ;
	Запись.ДатаВозвратуМенеджеру 	= ТекущаяДата();

	Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры
Процедура ЗавершениеПриЗавершенииХорошо(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		
		Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Отгружен);
		
	КонецЕсли;
	
КонецПроцедуры

// ВСПОМОГАТЕЛЬНЫЕ

Функция ПредставлениеЗадачи(Задача)
	
	Возврат ФункцииБизнесПроцессов.ПредставлениеЗадачиПоЗаказу(Задача, Заказ);
	
КонецФункции  

// КОРРЕКТИРОВКА

Процедура СкорректироватьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Если ТипЗнч(ВедущаяЗадача.БизнесПроцесс) <> Тип("БизнесПроцессСсылка.СборкаЗаказа") Или ВедущаяЗадача.БизнесПроцесс.Завершен Тогда
		
		//+Андриянов 11.05.2017 меняем проверку Заказы.ЗаказЧастичноСобран на новую Заказы.ЗаказБылВСборке, так как ЧастичноСобран отвечает на другой вопрос
		Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа[?(Заказы.ЗаказБылВСборке(Ссылка),"ВОчередиНаСкладПовторно","ВОчередиНаСклад")]); КонецЕсли;
	 УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи);
	 
	 // Установим параллельность
	 
	 Если ПараметрыСеанса.УстановитьПараллельныйПризнак Тогда
	 	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Параллельная = Истина КонецЦикла;
	 	ПараметрыСеанса.УстановитьПараллельныйПризнак = Ложь; КонецЕсли;
	
	// Установим время последнего отчета // отключим ожидание заказа
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Истина ИЗ РегистрСведений.ОчередьСборкиПриПередачеЛогисту ГДЕ Заказ = &Заказ"); Запрос.УстановитьПараметр("Заказ", Заказ);
	Если Запрос.Выполнить().Пустой() Тогда
		
		// Запишем регистр
				
		Запись = РегистрыСведений.ОчередьСборкиПриПередачеЛогисту.СоздатьМенеджерЗаписи();
		Запись.Заказ 		= Заказ;
		Запись.ДатаОтсчета 	= ТекущаяДата();
			
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда
			Отказ = Истина; КонецЕсли;КонецЕсли;
		
КонецПроцедуры
Процедура СкорректироватьЗаказОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	// Проверим есть ли неразмещенные товары
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Представление(Номенклатура) Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(,ЗаказПокупателя = &Заказ)
	|ГДЕ
	|	Размещение = &ПустойСклад
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Представление(Номенклатура) Номенклатура
	|ИЗ
	|	РегистрНакопления.ИнтернетЗаказПокупателя.Остатки(,ИнтернетЗаказ = &Заказ)
	|ГДЕ
	|	Размещение = &ПустойСклад
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Представление(Номенклатура) Номенклатура
	|ИЗ
	|	РегистрНакопления.ВнутренниеЗаказы.Остатки(,ВнутреннийЗаказ = &Заказ)
	|ГДЕ
	|	Размещение = &ПустойСклад
	|");
	
	Запрос.УстановитьПараметр("Заказ", 			Заказ);
	Запрос.УстановитьПараметр("ПустойСклад", 	Справочники.Склады.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = Ложь;
		ОбщиеФункции.СообщитьТекст("Не размещен """ + Выборка.Номенклатура + """");
		
	КонецЦикла;
	
КонецПроцедуры


// РЕАЛИЗАЦИЯ

Функция СоздатьИПровестиРеализацию(Задача)
	
	Если Заказ.СпособРазмещенияБезЗаказа Тогда // По новому
			
			ТоварыЗаказа 	= Заказы.ПолучитьТаблицуТоваровПоЗаказуСРаставленнымСостоянием(Ссылка,Заказ,,ТипЗнч(Заказ) <> Тип("ДокументСсылка.ВнутреннийЗаказ"));
			Товары 			= КонвертацияТипов.ПолучитьТаблицуИзНайденныхСтрокТаблицыЗначений(ТоварыЗаказа, Новый Структура("Состояние", Перечисления.СостояниеСборкиЗаказа.Собрано));
			
	Иначе // По старому
	
		Товары = Заказы.ПолучитьТоварыПоСтатусу(
						Задача.БизнесПроцесс, 
						ТекущаяДата(), 
						Перечисления.СостояниеСборкиЗаказа.Собрано); КонецЕсли;
						
	Если Товары.Количество() Тогда
		
		// Убираем временно контроль оплаты, они там не могут разобраться нужен он или нет
					
		//Если Заказ.РозничнаяЗаявка Тогда
		//	
		//	ПараметрыРозница = Новый Массив;
		//	Если НЕ Заказы.ЗаказОплачен(Заказ, ПараметрыРозница, Товары.Итог("Сумма")) Тогда
		//		ОбщиеФункции.СообщитьТекст("Заказ не оплачен, поэтому не может быть отгружен");	Возврат Ложь; КонецЕсли;КонецЕсли; 	
	

		// Определим источник
	
		Заказ = ПолучитьЗаказ(Задача);
		
		ЭтоПередача = Склад.ПередачаТовараМВЗ ИЛИ НЕ Заказ.МВЗ.Пустая() ИЛИ Заказ.ПередачаТовара;
		Если ЭтоПередача Тогда
			
			Реализация = Документы.ПередачаТовара.СоздатьДокумент();
			Реализация.ОтветственноеЛицо = Заказ.ОтветственноеЛицо;
			Реализация.МВЗ = Заказ.МВЗ;
			
		Иначе
			
			// Определим источник
	
			Реализация = Документы.РеализацияТоваров.СоздатьДокумент();КонецЕсли;
		
	    Реализация.СниматьРезервИзШапки = Заказ.СпособРазмещенияБезЗаказа; 
		Реализация.Дата	= ТекущаяДата();
		
		// Забъем реквизиты по запросу
		
		СтруктураШапки = Заказы.ПолучитьРеквизитыЗаказаДляЗаполненияШапкиДокумента(Заказ);
		ЗаполнитьЗначенияСвойств(Реализация, СтруктураШапки);
		
		// Загрузим таблицу для закрытия сборки
		
		Реализация.СобранныеТовары.Загрузить(Заказы.ПолучитьТаблицуСобранныхТоваров(Заказ, СтруктураШапки.Склад));
		
		// Если Розничная заявка
		
		//Если Заказ.РозничнаяЗаявка И ПараметрыРозница <> Неопределено Тогда
		//	Для Каждого Парам ИЗ ПараметрыРозница Цикл
		//		НовСтрока = Реализация.ПлатежныеДокументы.Добавить();
		//		НовСтрока.ДокументОплаты = Парам.ДокументОплаты;
		//		НовСтрока.Сумма = Парам.Сумма;
		//	КонецЦикла;
		//КонецЕсли;
	
		
		// Вытащим товары
		
		ТипыЗаказа = Новый Массив;
		ТипыЗаказа.Добавить(ТипЗнч(Заказ));
		Товары.Колонки.Добавить("Заказ", Новый ОписаниеТипов(ТипыЗаказа));
		Товары.ЗаполнитьЗначения(Заказ, "Заказ");
		
		Товары.Колонки.Добавить("НомерГТД", Новый ОписаниеТипов("СправочникСсылка.НомераГТД"));
		Заказы.ПроставитьНомерГТД(Товары);

		//Товары.Колонки.СкладЯчейка.Имя = "Размещение";
		Если Не Заказ.СпособРазмещенияБезЗаказа Тогда
			Товары.Колонки.Склад.Имя = "Размещение";
			Товары.Колонки.СкладЯчейка.Имя = "СкладЯчейкаСборки";
			Товары.ЗаполнитьЗначения(Справочники.Ячейки.ПустаяСсылка(), "Ячейка"); КонецЕсли;
			Реализация.Товары.Загрузить(Товары);
		
		// Установим заказ который еще не может быть прочитан
		
		Реализация.ДополнительныеСвойства.Вставить("ОперативныйЗаказ", Заказ);
		
		// Запишем чтобы ссылку получить
		
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Реализация, РежимЗаписиДокумента.Запись) Тогда
			Возврат Ложь; КонецЕсли;
		
		// Заполним оплаты
		
		Реализация.ДополнительныеСвойства.Вставить("НеРазноситьПартии", Истина); // ПередЗаписью партии разнеслись, запомним это
		
		Если НЕ ЭтоПередача И НЕ Заказ.РозничнаяЗаявка Тогда
			Реализация.ЗаполнитьДокументыОплаты(Реализация.Ссылка); КонецЕсли;
	
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Реализация, РежимЗаписиДокумента.Проведение) Тогда
			Возврат Ложь; КонецЕсли;
		
		Если Не БизнесПроцессы.ДоставкаЗаказа.СоздатьНовыйБП(Заказ,Реализация.Ссылка) Тогда Возврат Ложь КонецЕсли;

		// УСтановим ию в текущий процесс
	
		РеализацияТоваров = Реализация.Ссылка; КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
Процедура ОтгрузитьЗаказПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	текСостояние = Заказы.ПолучитьСостояниеЗаказа(Задача.БизнесПроцесс.Заказ);
	Если текСостояние <> Перечисления.СостоянияЗаказа.ВОчередиНаСклад Тогда
		Если Не СоздатьИПровестиРеализацию(Задача) Тогда Отказ = Истина КонецЕсли КонецЕсли;
		
	// Если отработала тогда запишем текущий процесс и его реализацию
	
	Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(ЭтотОбъект) Тогда
		Отказ = Истина; КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
Процедура ОтгрузитьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Если 	Не Отказ И 
			Не Заказы.УстановитьСостояниеЗаказа(
							Заказ, 
							Перечисления.СостоянияЗаказа[
								?(Заказы.ЗаказЧастичноСобран(Ссылка),
													"СобранЧастично",
													"Собран")]) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи);

КонецПроцедуры


// УСЛОВИЯ

Процедура ВернутьМенеджеруПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Заказы.ПолучитьСостояниеЗаказа(Заказ) = Перечисления.СостоянияЗаказа.ВРаботе;
	
КонецПроцедуры
Функция ЗаказОтгруженПолностью()
	
	// Если нет товаров значит все собрали
	
	СостоянияТоваров = Заказы.ПолучитьСостояниеТоваров(Ссылка,,,Ложь);
	Возврат 
		СостоянияТоваров.НайтиСтроки(Новый Структура("Состояние", Перечисления.СостояниеСборкиЗаказа.Отгружен )).Количество() +
		СостоянияТоваров.НайтиСтроки(Новый Структура("Состояние", Перечисления.СостояниеСборкиЗаказа.Отправлен)).Количество() +
		СостоянияТоваров.НайтиСтроки(Новый Структура("Состояние", Перечисления.СостояниеСборкиЗаказа.Доставлен)).Количество() = СостоянияТоваров.Количество();
	
КонецФункции
Процедура Условие_ЗаказСобранПолностьюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// Только в состоянии "собран" может быть передан на отгрузку
	
	РазрешенноеСостояние 	= Перечисления.СостояниеСборкиЗаказа.Собрано;
	Товары 					= Заказы.ПолучитьСостояниеТоваров(Ссылка,,, Ложь);
	Результат 				= Истина;
	
	Для Каждого Строка Из Товары Цикл Если Строка.Состояние <> РазрешенноеСостояние Тогда Результат = Ложь; Возврат; КонецЕсли; КонецЦикла;
	
КонецПроцедуры

Процедура ЛогистрПередумалПриОтгрузке(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Заказы.ПолучитьСостояниеЗаказа(Заказ) = Перечисления.СостоянияЗаказа.ВОчередиНаСклад;
	
КонецПроцедуры

// КОРРЕКТИРОВКА ЛОГИСТОВ

Процедура ЗафиксироватьВремяСборкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// Установим время продажи
	
	Запись = РегистрыСведений.ОчередьСборкиПриПередачеЛогисту.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	
	// Запишем
	
	Если ЗначениеЗаполнено(Запись.Заказ) Тогда
		Запись.ДатаСборки = ТекущаяДата();
		ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись); КонецЕсли;
	
КонецПроцедуры
Процедура ОтменитьВремяСборкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// Установим время продажи
	
	Запись = РегистрыСведений.ОчередьСборкиПриПередачеЛогисту.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	
	// Запишем
	
	Если ЗначениеЗаполнено(Запись.Заказ) Тогда
		Запись.ДатаСборки = '00010101';
		ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись); КонецЕсли;
	
КонецПроцедуры


Процедура УстановитьСтатусОтгруженОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Отгружен);
	
КонецПроцедуры
Процедура УстановитьСтатусВОчередиНаСборкуОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.ВОчередиНаСборку);
	
КонецПроцедуры


Процедура ЗаказОтгруженУсловие(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ЗаказОтгруженПолностью();
	
КонецПроцедуры

Процедура МимоЛогистаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Рузультат = Истина;
	
КонецПроцедуры

Процедура СоздатьСборкуОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ТабТов = КонвертацияТипов.ПолучитьТаблицуИзНайденныхСтрокТаблицыЗначений(
				Заказы.ПолучитьСостояниеТоваров(Заказ),
				Новый Структура("Состояние", Перечисления.СостояниеСборкиЗаказа.НеСобрано));
				
	СкладПолучатель = ?(ТипЗнч(Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ"), Заказ.Заказчик, Склад);
	Если Не БизнесПроцессы.СборкаЗаказа.СформироватьИПровестиСборкуИперемещения(Заказ, Ссылка, СкладПолучатель, ТабТов) Тогда
		ВызватьИсключение "Ошибка при создании сборки минуя логиста "; КонецЕсли;	
	
	// Установим признак параллельности чтобы следующий БП сбросил
	
	ПараметрыСеанса.УстановитьПараллельныйПризнак = Истина;

КонецПроцедуры
